## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PublishGrantEvents"
      ~ last_modified                  = "2023-07-14T23:12:02.734+0000" -> "2023-07-14T23:12:10.838+0000"
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_dashboard.service_dashboard[0] will be updated in-place
  ~ resource "datadog_dashboard" "service_dashboard" {
        id                      = "r2k-2tv-mui"
        tags                    = []
        # (9 unchanged attributes hidden)

      ~ template_variable {
-           default          = "production" -> null
          ~ defaults         = [
+               "production",
            ]
            name             = "env"
            # (2 unchanged attributes hidden)
        }
      ~ template_variable {
-           default          = "grants-ingest" -> null
          ~ defaults         = [
+               "grants-ingest",
            ]
            name             = "service"
            # (2 unchanged attributes hidden)
        }
      ~ template_variable {
-           default          = "*" -> null
          ~ defaults         = [
+               "*",
            ]
            name             = "version"
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.event.published"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.event.published"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.grant_data.invalid"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.grant_data.invalid"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.invocation_batch_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.invocation_batch_size"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.build"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.item_image.build"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.malformatted_field"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.item_image.malformatted_field"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.record.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.record.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-07-14T23:12:00.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:14" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:14/invocations" -> (known after apply)
      ~ s3_key                         = "builds/7ba51be5b5f8fd01546a13e95a1f7208fca744b1ebc5cc98b6d1c4d6c299f9e7.zip" -> "builds/24b7962dbfa8232b55eb408343ec816f5054516aa0d5a68556137f885404d23e.zip"
      ~ s3_object_version              = "5yo6yvHs5WZHVf3tgEzO8TY3SXV0atLK" -> (known after apply)
        tags                           = {}
      ~ version                        = "14" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:2a1cf0a92bc51ffbae2956daa778ed0a43388a75,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:1314e2242a9a12f58ad93c4088c7c0b2d1950de5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "2a1cf0a92bc51ffbae2956daa778ed0a43388a75" -> "1314e2242a9a12f58ad93c4088c7c0b2d1950de5"
                # (12 unchanged elements hidden)
            }
        }

+       timeouts {}

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "14" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "aa4444fce4a2b296cdb54b6eb7c1532f-2" -> (known after apply)
      ~ id                     = "builds/7ba51be5b5f8fd01546a13e95a1f7208fca744b1ebc5cc98b6d1c4d6c299f9e7.zip" -> (known after apply)
      ~ key                    = "builds/7ba51be5b5f8fd01546a13e95a1f7208fca744b1ebc5cc98b6d1c4d6c299f9e7.zip" -> "builds/24b7962dbfa8232b55eb408343ec816f5054516aa0d5a68556137f885404d23e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/7ba51be5b5f8fd01546a13e95a1f7208fca744b1ebc5cc98b6d1c4d6c299f9e7.zip" -> "builds/24b7962dbfa8232b55eb408343ec816f5054516aa0d5a68556137f885404d23e.zip"
-       tags                   = {} -> null
      ~ version_id             = "5yo6yvHs5WZHVf3tgEzO8TY3SXV0atLK" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/24b7962dbfa8232b55eb408343ec816f5054516aa0d5a68556137f885404d23e.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/24b7962dbfa8232b55eb408343ec816f5054516aa0d5a68556137f885404d23e.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3153009506637227711" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7ba51be5b5f8fd01546a13e95a1f7208fca744b1ebc5cc98b6d1c4d6c299f9e7.zip" -> "builds/24b7962dbfa8232b55eb408343ec816f5054516aa0d5a68556137f885404d23e.zip"
          ~ "timestamp" = "1689376288859068000" -> "1690133947489869200"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1812814773429147444" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/7ba51be5b5f8fd01546a13e95a1f7208fca744b1ebc5cc98b6d1c4d6c299f9e7.zip" -> "builds/24b7962dbfa8232b55eb408343ec816f5054516aa0d5a68556137f885404d23e.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-07-14T23:12:00.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:39" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:39/invocations" -> (known after apply)
      ~ s3_key                         = "builds/0845573c431b367bbb93f58728aec2265645f5c48eab73c4df5fbf3d34b21359.zip" -> "builds/99d1acdf8f09d67b1ba13fad196740c2af82b5c1abea8cdef1d9455e2785f146.zip"
      ~ s3_object_version              = "KN1zf.v.ebDiUzIreZZjpBpU94muk12S" -> (known after apply)
        tags                           = {}
      ~ version                        = "39" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:2a1cf0a92bc51ffbae2956daa778ed0a43388a75,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:1314e2242a9a12f58ad93c4088c7c0b2d1950de5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "2a1cf0a92bc51ffbae2956daa778ed0a43388a75" -> "1314e2242a9a12f58ad93c4088c7c0b2d1950de5"
                # (12 unchanged elements hidden)
            }
        }

+       timeouts {}

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "39" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "38d7ac5a01eeca87c1986f518593951f-2" -> (known after apply)
      ~ id                     = "builds/0845573c431b367bbb93f58728aec2265645f5c48eab73c4df5fbf3d34b21359.zip" -> (known after apply)
      ~ key                    = "builds/0845573c431b367bbb93f58728aec2265645f5c48eab73c4df5fbf3d34b21359.zip" -> "builds/99d1acdf8f09d67b1ba13fad196740c2af82b5c1abea8cdef1d9455e2785f146.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/0845573c431b367bbb93f58728aec2265645f5c48eab73c4df5fbf3d34b21359.zip" -> "builds/99d1acdf8f09d67b1ba13fad196740c2af82b5c1abea8cdef1d9455e2785f146.zip"
-       tags                   = {} -> null
      ~ version_id             = "KN1zf.v.ebDiUzIreZZjpBpU94muk12S" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/99d1acdf8f09d67b1ba13fad196740c2af82b5c1abea8cdef1d9455e2785f146.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/99d1acdf8f09d67b1ba13fad196740c2af82b5c1abea8cdef1d9455e2785f146.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "857216909204372472" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0845573c431b367bbb93f58728aec2265645f5c48eab73c4df5fbf3d34b21359.zip" -> "builds/99d1acdf8f09d67b1ba13fad196740c2af82b5c1abea8cdef1d9455e2785f146.zip"
          ~ "timestamp" = "1689376271330292000" -> "1690133930860591000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3476260685692148069" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/0845573c431b367bbb93f58728aec2265645f5c48eab73c4df5fbf3d34b21359.zip" -> "builds/99d1acdf8f09d67b1ba13fad196740c2af82b5c1abea8cdef1d9455e2785f146.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-07-14T23:11:57.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:19" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:19/invocations" -> (known after apply)
      ~ s3_key                         = "builds/860934197ab09f8a531d520dfe16823a9fb2f52ec2dc3c055902e5ad0f51118f.zip" -> "builds/f9c6d373eee2d48ef5d6a0f5691018ae0f24bc7c9235d65623dde4d259f69d2b.zip"
      ~ s3_object_version              = "NDI99sLYXL80Bbmr46r1auQiDNJ9rJe5" -> (known after apply)
        tags                           = {}
      ~ version                        = "19" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:2a1cf0a92bc51ffbae2956daa778ed0a43388a75,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:1314e2242a9a12f58ad93c4088c7c0b2d1950de5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "2a1cf0a92bc51ffbae2956daa778ed0a43388a75" -> "1314e2242a9a12f58ad93c4088c7c0b2d1950de5"
                # (12 unchanged elements hidden)
            }
        }

+       timeouts {}

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "19" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0892a5083b2f967afb322af9878862fd-2" -> (known after apply)
      ~ id                     = "builds/860934197ab09f8a531d520dfe16823a9fb2f52ec2dc3c055902e5ad0f51118f.zip" -> (known after apply)
      ~ key                    = "builds/860934197ab09f8a531d520dfe16823a9fb2f52ec2dc3c055902e5ad0f51118f.zip" -> "builds/f9c6d373eee2d48ef5d6a0f5691018ae0f24bc7c9235d65623dde4d259f69d2b.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/860934197ab09f8a531d520dfe16823a9fb2f52ec2dc3c055902e5ad0f51118f.zip" -> "builds/f9c6d373eee2d48ef5d6a0f5691018ae0f24bc7c9235d65623dde4d259f69d2b.zip"
-       tags                   = {} -> null
      ~ version_id             = "NDI99sLYXL80Bbmr46r1auQiDNJ9rJe5" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/f9c6d373eee2d48ef5d6a0f5691018ae0f24bc7c9235d65623dde4d259f69d2b.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f9c6d373eee2d48ef5d6a0f5691018ae0f24bc7c9235d65623dde4d259f69d2b.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5959741361938685684" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/860934197ab09f8a531d520dfe16823a9fb2f52ec2dc3c055902e5ad0f51118f.zip" -> "builds/f9c6d373eee2d48ef5d6a0f5691018ae0f24bc7c9235d65623dde4d259f69d2b.zip"
          ~ "timestamp" = "1689376289063202000" -> "1690133947836814000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8195113782754754347" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/860934197ab09f8a531d520dfe16823a9fb2f52ec2dc3c055902e5ad0f51118f.zip" -> "builds/f9c6d373eee2d48ef5d6a0f5691018ae0f24bc7c9235d65623dde4d259f69d2b.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-07-14T23:12:01.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:8/invocations" -> (known after apply)
      ~ s3_key                         = "builds/de8549154296529c7aa59702c97b3584a3c0225db9b2cc4c101d33ebf464b6a8.zip" -> "builds/f5b18f19e01c3395cef38fe1d775ace90c99ae08d66100dc7835ad0f1a0d7ea5.zip"
      ~ s3_object_version              = "iPdU_58BO.CNQoMrOevLhJ7NVEDR2ST0" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:2a1cf0a92bc51ffbae2956daa778ed0a43388a75,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:1314e2242a9a12f58ad93c4088c7c0b2d1950de5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "2a1cf0a92bc51ffbae2956daa778ed0a43388a75" -> "1314e2242a9a12f58ad93c4088c7c0b2d1950de5"
                # (11 unchanged elements hidden)
            }
        }

+       timeouts {}

        # (2 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "079d4e3cdfce0c986bd43f898d48f04a-2" -> (known after apply)
      ~ id                     = "builds/de8549154296529c7aa59702c97b3584a3c0225db9b2cc4c101d33ebf464b6a8.zip" -> (known after apply)
      ~ key                    = "builds/de8549154296529c7aa59702c97b3584a3c0225db9b2cc4c101d33ebf464b6a8.zip" -> "builds/f5b18f19e01c3395cef38fe1d775ace90c99ae08d66100dc7835ad0f1a0d7ea5.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/de8549154296529c7aa59702c97b3584a3c0225db9b2cc4c101d33ebf464b6a8.zip" -> "builds/f5b18f19e01c3395cef38fe1d775ace90c99ae08d66100dc7835ad0f1a0d7ea5.zip"
-       tags                   = {} -> null
      ~ version_id             = "iPdU_58BO.CNQoMrOevLhJ7NVEDR2ST0" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/f5b18f19e01c3395cef38fe1d775ace90c99ae08d66100dc7835ad0f1a0d7ea5.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f5b18f19e01c3395cef38fe1d775ace90c99ae08d66100dc7835ad0f1a0d7ea5.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1868108409703660241" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/de8549154296529c7aa59702c97b3584a3c0225db9b2cc4c101d33ebf464b6a8.zip" -> "builds/f5b18f19e01c3395cef38fe1d775ace90c99ae08d66100dc7835ad0f1a0d7ea5.zip"
          ~ "timestamp" = "1689376288822685000" -> "1690133947902900000"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "686517103685270286" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/de8549154296529c7aa59702c97b3584a3c0225db9b2cc4c101d33ebf464b6a8.zip" -> "builds/f5b18f19e01c3395cef38fe1d775ace90c99ae08d66100dc7835ad0f1a0d7ea5.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-07-14T23:12:01.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:9/invocations" -> (known after apply)
      ~ s3_key                         = "builds/f6316914e01ccfdfc7b92a69be0b08fc0751d5b0b97785c10fae96f6bbf19386.zip" -> "builds/51621e0e86efb07300329f710973bbb6540826b31fc1cb18e90f2b91ff90498b.zip"
      ~ s3_object_version              = "MEh4qJ5UkiH_fbo2vPO5Y7mgYqMGBPPH" -> (known after apply)
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:2a1cf0a92bc51ffbae2956daa778ed0a43388a75,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:1314e2242a9a12f58ad93c4088c7c0b2d1950de5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "2a1cf0a92bc51ffbae2956daa778ed0a43388a75" -> "1314e2242a9a12f58ad93c4088c7c0b2d1950de5"
                # (12 unchanged elements hidden)
            }
        }

+       timeouts {}

        # (2 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "9" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "55bd3894cea97a40eb851c6c277d0689-2" -> (known after apply)
      ~ id                     = "builds/f6316914e01ccfdfc7b92a69be0b08fc0751d5b0b97785c10fae96f6bbf19386.zip" -> (known after apply)
      ~ key                    = "builds/f6316914e01ccfdfc7b92a69be0b08fc0751d5b0b97785c10fae96f6bbf19386.zip" -> "builds/51621e0e86efb07300329f710973bbb6540826b31fc1cb18e90f2b91ff90498b.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/f6316914e01ccfdfc7b92a69be0b08fc0751d5b0b97785c10fae96f6bbf19386.zip" -> "builds/51621e0e86efb07300329f710973bbb6540826b31fc1cb18e90f2b91ff90498b.zip"
-       tags                   = {} -> null
      ~ version_id             = "MEh4qJ5UkiH_fbo2vPO5Y7mgYqMGBPPH" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/51621e0e86efb07300329f710973bbb6540826b31fc1cb18e90f2b91ff90498b.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/51621e0e86efb07300329f710973bbb6540826b31fc1cb18e90f2b91ff90498b.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3320840181704114215" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f6316914e01ccfdfc7b92a69be0b08fc0751d5b0b97785c10fae96f6bbf19386.zip" -> "builds/51621e0e86efb07300329f710973bbb6540826b31fc1cb18e90f2b91ff90498b.zip"
          ~ "timestamp" = "1689376288959688000" -> "1690133947629381000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6212922726728293016" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/f6316914e01ccfdfc7b92a69be0b08fc0751d5b0b97785c10fae96f6bbf19386.zip" -> "builds/51621e0e86efb07300329f710973bbb6540826b31fc1cb18e90f2b91ff90498b.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-07-14T23:12:00.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:11/invocations" -> (known after apply)
      ~ s3_key                         = "builds/2665d3f6d148430cd92a40faf3bb4f1f3c2fdd4f1dac11b97abc741bdbebedfb.zip" -> "builds/d82db2c5fb9566bcf2b83d436aeed1f329c389e7b0cd228e255efb67ab3d70ad.zip"
      ~ s3_object_version              = "jpLoLz_kGb30awX91nDOooaNC3uOxSAo" -> (known after apply)
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:2a1cf0a92bc51ffbae2956daa778ed0a43388a75,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:1314e2242a9a12f58ad93c4088c7c0b2d1950de5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "2a1cf0a92bc51ffbae2956daa778ed0a43388a75" -> "1314e2242a9a12f58ad93c4088c7c0b2d1950de5"
                # (12 unchanged elements hidden)
            }
        }

+       timeouts {}

        # (2 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "11" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d4159272d564f6a174f7bc51ab9c5499-2" -> (known after apply)
      ~ id                     = "builds/2665d3f6d148430cd92a40faf3bb4f1f3c2fdd4f1dac11b97abc741bdbebedfb.zip" -> (known after apply)
      ~ key                    = "builds/2665d3f6d148430cd92a40faf3bb4f1f3c2fdd4f1dac11b97abc741bdbebedfb.zip" -> "builds/d82db2c5fb9566bcf2b83d436aeed1f329c389e7b0cd228e255efb67ab3d70ad.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/2665d3f6d148430cd92a40faf3bb4f1f3c2fdd4f1dac11b97abc741bdbebedfb.zip" -> "builds/d82db2c5fb9566bcf2b83d436aeed1f329c389e7b0cd228e255efb67ab3d70ad.zip"
-       tags                   = {} -> null
      ~ version_id             = "jpLoLz_kGb30awX91nDOooaNC3uOxSAo" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/d82db2c5fb9566bcf2b83d436aeed1f329c389e7b0cd228e255efb67ab3d70ad.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/d82db2c5fb9566bcf2b83d436aeed1f329c389e7b0cd228e255efb67ab3d70ad.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "692881246513526578" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2665d3f6d148430cd92a40faf3bb4f1f3c2fdd4f1dac11b97abc741bdbebedfb.zip" -> "builds/d82db2c5fb9566bcf2b83d436aeed1f329c389e7b0cd228e255efb67ab3d70ad.zip"
          ~ "timestamp" = "1689376271240367000" -> "1690133930913269000"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "2862697758826125335" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/2665d3f6d148430cd92a40faf3bb4f1f3c2fdd4f1dac11b97abc741bdbebedfb.zip" -> "builds/d82db2c5fb9566bcf2b83d436aeed1f329c389e7b0cd228e255efb67ab3d70ad.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PublishGrantEvents"
      ~ last_modified                  = "2023-07-14T23:12:10.838+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PublishGrantEvents:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PublishGrantEvents:1/invocations" -> (known after apply)
      ~ s3_key                         = "builds/c92372b54b03754b60c5ad5b754f8960a9db0c133579569c91df1685a9c3e4e9.zip" -> "builds/e63f14ba2cc3d38f088b581eb07a24017ef75bbd06f4d6b11dbefad6f8d86ee3.zip"
      ~ s3_object_version              = "xXV64zOGh9RWh8goFEwgUjC6.lfLrX4f" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:2a1cf0a92bc51ffbae2956daa778ed0a43388a75,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents" -> "git.commit.sha:1314e2242a9a12f58ad93c4088c7c0b2d1950de5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents"
              ~ "DD_VERSION"                   = "2a1cf0a92bc51ffbae2956daa778ed0a43388a75" -> "1314e2242a9a12f58ad93c4088c7c0b2d1950de5"
                # (11 unchanged elements hidden)
            }
        }

+       timeouts {}

        # (2 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "7441c1633128bed126e7fdcf5777ae0a-2" -> (known after apply)
      ~ id                     = "builds/c92372b54b03754b60c5ad5b754f8960a9db0c133579569c91df1685a9c3e4e9.zip" -> (known after apply)
      ~ key                    = "builds/c92372b54b03754b60c5ad5b754f8960a9db0c133579569c91df1685a9c3e4e9.zip" -> "builds/e63f14ba2cc3d38f088b581eb07a24017ef75bbd06f4d6b11dbefad6f8d86ee3.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/c92372b54b03754b60c5ad5b754f8960a9db0c133579569c91df1685a9c3e4e9.zip" -> "builds/e63f14ba2cc3d38f088b581eb07a24017ef75bbd06f4d6b11dbefad6f8d86ee3.zip"
-       tags                   = {} -> null
      ~ version_id             = "xXV64zOGh9RWh8goFEwgUjC6.lfLrX4f" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PublishGrantEvents
                            cd bin/PublishGrantEvents
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/e63f14ba2cc3d38f088b581eb07a24017ef75bbd06f4d6b11dbefad6f8d86ee3.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/e63f14ba2cc3d38f088b581eb07a24017ef75bbd06f4d6b11dbefad6f8d86ee3.plan.json"
+       id                   = (known after apply)
    }

  # module.PublishGrantEvents.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1272216423898390078" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c92372b54b03754b60c5ad5b754f8960a9db0c133579569c91df1685a9c3e4e9.zip" -> "builds/e63f14ba2cc3d38f088b581eb07a24017ef75bbd06f4d6b11dbefad6f8d86ee3.zip"
          ~ "timestamp" = "1689376272512594000" -> "1690133931660563000"
        }
    }

  # module.PublishGrantEvents.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1822574248775021981" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/c92372b54b03754b60c5ad5b754f8960a9db0c133579569c91df1685a9c3e4e9.zip" -> "builds/e63f14ba2cc3d38f088b581eb07a24017ef75bbd06f4d6b11dbefad6f8d86ee3.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-07-14T23:12:01.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:10/invocations" -> (known after apply)
      ~ s3_key                         = "builds/8b4e30a017a06aa45aa99835002b81437f445de719fe10d9a9e2510906e5a077.zip" -> "builds/88f960ef72ab02fafcd3c49fc41fbd95e8dd117b41e67f7fb4f9d53e01f0a961.zip"
      ~ s3_object_version              = "JsTipvlhKiheTiI_KWYkXplTv4reeKwV" -> (known after apply)
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:2a1cf0a92bc51ffbae2956daa778ed0a43388a75,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:1314e2242a9a12f58ad93c4088c7c0b2d1950de5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "2a1cf0a92bc51ffbae2956daa778ed0a43388a75" -> "1314e2242a9a12f58ad93c4088c7c0b2d1950de5"
                # (15 unchanged elements hidden)
            }
        }

+       timeouts {}

        # (2 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "10" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "aacfe85588eb111d7dcab0a29f1b8bbe-2" -> (known after apply)
      ~ id                     = "builds/8b4e30a017a06aa45aa99835002b81437f445de719fe10d9a9e2510906e5a077.zip" -> (known after apply)
      ~ key                    = "builds/8b4e30a017a06aa45aa99835002b81437f445de719fe10d9a9e2510906e5a077.zip" -> "builds/88f960ef72ab02fafcd3c49fc41fbd95e8dd117b41e67f7fb4f9d53e01f0a961.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/8b4e30a017a06aa45aa99835002b81437f445de719fe10d9a9e2510906e5a077.zip" -> "builds/88f960ef72ab02fafcd3c49fc41fbd95e8dd117b41e67f7fb4f9d53e01f0a961.zip"
-       tags                   = {} -> null
      ~ version_id             = "JsTipvlhKiheTiI_KWYkXplTv4reeKwV" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/88f960ef72ab02fafcd3c49fc41fbd95e8dd117b41e67f7fb4f9d53e01f0a961.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/88f960ef72ab02fafcd3c49fc41fbd95e8dd117b41e67f7fb4f9d53e01f0a961.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "666344473461857255" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8b4e30a017a06aa45aa99835002b81437f445de719fe10d9a9e2510906e5a077.zip" -> "builds/88f960ef72ab02fafcd3c49fc41fbd95e8dd117b41e67f7fb4f9d53e01f0a961.zip"
          ~ "timestamp" = "1689376289108100800" -> "1690133947890827800"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7505932353551341034" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/8b4e30a017a06aa45aa99835002b81437f445de719fe10d9a9e2510906e5a077.zip" -> "builds/88f960ef72ab02fafcd3c49fc41fbd95e8dd117b41e67f7fb4f9d53e01f0a961.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-07-14T23:11:58.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:38" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:38/invocations" -> (known after apply)
      ~ s3_key                         = "builds/528eb4d8431b2abac834d0383a15bf3dd37ba9b1468613566f0f7ff222339ebb.zip" -> "builds/53e845ed7cf9423974f7a339c3b6ec6255715c7ced5e974d5d3b22330c983f53.zip"
      ~ s3_object_version              = "i_iEyC9rQ78EyIAWemxX_wXRUQHc2jUI" -> (known after apply)
        tags                           = {}
      ~ version                        = "38" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:2a1cf0a92bc51ffbae2956daa778ed0a43388a75,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:1314e2242a9a12f58ad93c4088c7c0b2d1950de5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "2a1cf0a92bc51ffbae2956daa778ed0a43388a75" -> "1314e2242a9a12f58ad93c4088c7c0b2d1950de5"
                # (15 unchanged elements hidden)
            }
        }

+       timeouts {}

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "38" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1c78e5e7b3fa067e274cdec2bb871fe7-2" -> (known after apply)
      ~ id                     = "builds/528eb4d8431b2abac834d0383a15bf3dd37ba9b1468613566f0f7ff222339ebb.zip" -> (known after apply)
      ~ key                    = "builds/528eb4d8431b2abac834d0383a15bf3dd37ba9b1468613566f0f7ff222339ebb.zip" -> "builds/53e845ed7cf9423974f7a339c3b6ec6255715c7ced5e974d5d3b22330c983f53.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/528eb4d8431b2abac834d0383a15bf3dd37ba9b1468613566f0f7ff222339ebb.zip" -> "builds/53e845ed7cf9423974f7a339c3b6ec6255715c7ced5e974d5d3b22330c983f53.zip"
-       tags                   = {} -> null
      ~ version_id             = "i_iEyC9rQ78EyIAWemxX_wXRUQHc2jUI" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/53e845ed7cf9423974f7a339c3b6ec6255715c7ced5e974d5d3b22330c983f53.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/53e845ed7cf9423974f7a339c3b6ec6255715c7ced5e974d5d3b22330c983f53.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1218660781217450387" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/528eb4d8431b2abac834d0383a15bf3dd37ba9b1468613566f0f7ff222339ebb.zip" -> "builds/53e845ed7cf9423974f7a339c3b6ec6255715c7ced5e974d5d3b22330c983f53.zip"
          ~ "timestamp" = "1689376271401673000" -> "1690133930772120000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7250306091143588501" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/528eb4d8431b2abac834d0383a15bf3dd37ba9b1468613566f0f7ff222339ebb.zip" -> "builds/53e845ed7cf9423974f7a339c3b6ec6255715c7ced5e974d5d3b22330c983f53.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 45 to add, 21 to change, 36 to destroy.
```

</details>

*Pusher: @jakekreider, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5637786142)*